zeha/xc32/pic32c-source/binutils/bfd/pic32m-allocate.c
/*
** pic32-allocate.c
**
** Copyright (c) 2009 Microchip Technology, Inc.
**
** This file contains pic32-specifc memory allocation
** processing for the linker.
**
** It is included by the following target-specific
** emulation files:
**
**   ld/emultmpl/elf32pic32mx.em
**
*/

/*****************************************************************************
**
** Improved Memory Allocation Routines
**
** These functions implement the improved
** memory allocator .
**
*/

/* useful constants and macros */
#define NEAR_BOUNDARY   0xa0010000

#define VALID_NEAR(addr, len) ((bfd_vma)(addr)+(len) <= NEAR_BOUNDARY)

#define VALID_LOW_ADDR(addr, len)  ((bfd_vma)(addr)+(len) <= exclude_addr)
#define VALID_HIGH_ADDR(addr, len)  ((bfd_vma)(addr) >= exclude_addr)

/* MERGE-NOTES: adding prefixes to attribute-related declarations to avoid
   warnings related to having common names like 'align' in the namespace.
   NB: if the 'a' macro argument can be a macro itself, the usage of ##
   below will need to be fixed to ensure expansion occurs before catenation. */

/* Create an id for each section attribute */
#define ATTR(a,b,c)  attr_id_##a,
 enum {
#include "pic32m-attributes.h"
 } ;

/* Create a bit mask for each section attribute */
#undef ATTR
#define ATTR(a,b,c)  attr_mask_##a = (1u<<attr_id_##a),
 enum {
#include "pic32m-attributes.h"
 } ;

/* Create a bit mask to match any attribute */
#define attr_mask_all_attr 0xFFFFFFFF

/* \lghica coresident*/
extern bfd_boolean pic32_coresident_app;
///\ prev_shared_dinit holds the address of the previous linked .shared.dinit section
extern bfd_vma prev_shared_dinit;
extern bfd_vma crt_shared_dinit;


/* Memory allocator options  */
enum {
  NO_LOCATE_OPTION,
  FAVOR_LOW_ADDR,     /* scan free blocks from low addr only  */
  FAVOR_HIGH_ADDR,    /* scan free blocks from high addr only */
  EXCLUDE_LOW_ADDR,   /* avoid memory below LIMIT             */
  EXCLUDE_HIGH_ADDR,  /* avoid memory above LIMIT - 1         */
  LOCATE_HIGHEST,
};

/* Data structure for free program memory blocks */
extern struct pic32_memory *program_memory_free_blocks;

static void
finish_section_info(struct pic32_section *s, lang_output_section_statement_type *os);

void sort_coherent_group_section (unsigned int mask);
void swap_sections_within_group (struct pic32_section *a,
				 struct pic32_section *b);

/* in cpu-pic32m.c */
extern int pic32_is_fltpt_machine (const bfd_arch_info_type *);

static int locate_options = 0;
static bfd_vma exclude_addr = 0;
static bfd_vma ramfunc_begin = 0;

static void
set_locate_options(int optionvalue, bfd_vma addr) {
  locate_options = optionvalue;
  exclude_addr = addr;
}

static void
reset_locate_options(void) {
  locate_options = NO_LOCATE_OPTION;
  exclude_addr = 0;
}

#define IS_LOCATE_OPTION(a)  ((locate_options & (a)) == (a))

static void
remove_section_from_bfd(bfd *abfd, asection *sec)
{
  asection *s, *prev;

  s = abfd->sections;
  if ((s == NULL) || (s->next == NULL)) return;

  /* as a sanity check, search for the section in the bfd */
  /* this can be removed or made optional if speed is an issue */
#if 1
  /* lookup 'sec' starting with 2nd bfd section (never remove the 1st one) */
  s = s->next;
  while (s != sec && s != NULL)
    s = s->next;
  /* didn't find it */
  if (s == NULL)
#else
  /* simple test for not removing the 1st section */
  if (sec == NULL || sec->prev == NULL)
#endif
   return;

  prev = sec->prev;  
  prev->next = sec->next;
  
  if (sec->next)
    sec->next->prev = prev;
  else
    abfd->section_last = prev; /*update the bfd->section_last field
                                 if the removed section is the
                                 last section.*/
  abfd->section_count -= 1;
  if (pic32_debug)
     printf("    removing section %s\n", s->name);
  return;
} /* static void remove_section_from_bfd (...)*/


static void
report_allocation_error(struct pic32_section *s) {
#define PREFIX "/tmp"
    char *colon = "";
    char *filename = "";
    char *secname = "*";
    char *s1 = pic32_section_size_string(s->sec);
    char *s2 = pic32_section_attr_string(s->sec);

    /* report the file name, unless its a temp file */
    if (strncmp(s->sec->owner->filename, PREFIX, strlen(PREFIX)) != 0) {
      colon = ":";
      filename = (char *) s->sec->owner->filename;
    }

    /* report the section name, unless its based on a temp file */
    if (strncmp(s->sec->name, PREFIX, strlen(PREFIX)) != 0)
      secname = (char *) s->sec->name;

    einfo(_("%X%s%s Link Error: Could not allocate section %s, %s, %s\n"),
          filename, colon, secname, s1 ? s1 : "", s2 ? s2 : "");

    if (s1) free(s1);  /* free the malloc'ed strings */
    if (s2) free(s2);

    if (pic32_debug)
      printf("\n    Error: Could not allocate section %s\n", s->sec->name);
}

extern asection* init_shared_template;


/*
 * update_shared_dinit_addr()
 *
 * This function updates __shared_dinit_addr. It is used in coresident context, 
 * when shared variables are used. If shared variables are used in 2 linking steps,
 * the value hold by __shared_dinit_addr at this linking phase is the one 
 * set in the previous step. This function updates the value, but also save the 
 * old value in a variable, as it is needed for .shared.dinit section update
 *
 * Called by: allocate_memory()
 *
 * Calls:     bfd_link_hash_lookup()
 *
 */
static void update_shared_dinit_addr(void)
{
    asection*                   shared_dinit_sec;
    struct bfd_link_hash_entry  *h_sym;
    bfd_vma                     new_shared_addr = 0;
    
    h_sym = bfd_link_hash_lookup(link_info.hash, "__shared_dinit_addr", FALSE, FALSE, TRUE);
    

    shared_dinit_sec = init_shared_template->output_section;
    
    if (shared_dinit_sec != NULL)
    {
        //if (pic32_debug)
        //{
        //    printf ("LG --- .shared.dinit LMA 0x%x\n", shared_dinit_sec->lma);
        //}
        new_shared_addr = shared_dinit_sec->lma;
    }
    
    if ((h_sym != NULL)
        && (h_sym->u.def.section == bfd_abs_section_ptr))
    {
        //if (pic32_debug)
        //    printf("LG --- shared_dinit_addr - 0x%x\n", h_sym->u.def.value);
        
        if ((new_shared_addr != 0) && (new_shared_addr != h_sym->u.def.value))
        {
            ///\ update the content of the previous .shared.dinit section
            prev_shared_dinit = h_sym->u.def.value;
            crt_shared_dinit = new_shared_addr;
            h_sym->u.def.value = new_shared_addr;
        }
    }
}

