zeha/xc32/pic32c-source/binutils/bfd/pic32m-allocate.c
/*
 * allocate_program_memory()
 *
 * This function attempts to allocate program memory sections.
 *
 * Called by: allocate_memory()
 *
 * Calls:     build_alloc_section_list()
 *            build_free_block_list()
 *            locate_sections()
 *            pic32_section_list_length()
 *
 * Returns:   status code
 *            (0 = success)
 */
static int
allocate_program_memory() {
  struct memory_region_struct *region;
  unsigned int mask = attr_mask_code;
  int result = 0;

  if (pic32_debug)
    printf("\nBuilding allocation list for region \"program\"\n"
           "  attribute mask = %x\n", mask);

  build_alloc_section_list(mask);
  if (pic32_section_list_length(alloc_section_list) == 0)
    return result;

  region = region_lookup ("kseg0_program_mem");
  build_free_block_list(region, mask);

  if (pic32_debug) {
    pic32_print_section_list(alloc_section_list, "allocation");
  }

#if 0
  if (pic32_debug)
    pic32_print_section_list(unassigned_sections, "unassigned");
#endif

  reset_locate_options();
  result |= locate_sections(attr_mask_address, 0, region);   /* most restrictive  */
  result |= locate_sections(attr_mask_all_attr, 0, region);  /* least restrictive */

  /* save the free blocks list */
  program_memory_free_blocks = free_blocks;
  free_blocks = 0;
    
  return result;
} /* allocate_program_memory() */

static int
allocate_serial_memory() {
  struct memory_region_struct *region;
  unsigned int mask = attr_mask_serial_mem;
  int result = 0;

  if (pic32_debug)
    printf("\nBuilding allocation list for region \"serial memory\"\n"
           "  attribute mask = %x\n", mask);

  build_alloc_section_list(mask);

  if (pic32_section_list_length(alloc_section_list) == 0)
    return result;

  region = region_lookup ("serial_mem");
  build_free_block_list(region, mask);

  if (pic32_debug) {
    pic32_print_section_list(alloc_section_list, "allocation");
  }

#if 0
  if (pic32_debug)
    pic32_print_section_list(unassigned_sections, "unassigned");
#endif

  reset_locate_options();
  result |= locate_sections(attr_mask_address, 0, region);   /* most restrictive  */
  result |= locate_sections(attr_mask_all_attr, 0, region);  /* least restrictive */

  return result;
} /* allocate_serial_memory() */


static int allocate_bss(struct memory_region_struct * const region)
{
    struct pic32_section *s;
    int result = 0;

    if (pic32_debug)
        fprintf(stderr,"\nBuilding bss allocation list attribute mask = %x\n", attr_mask_bss);

    build_alloc_section_list(attr_mask_bss);

    reset_locate_options();
    result |= locate_sections(attr_mask_bss, 0, region);
    return result;
}


/*
 * allocate_data_memory()
 *
 * This function attempts to allocate data memory sections.
 *
 * Called by: allocate_memory()
 *
 * Calls:     build_section_list()
 *            build_free_block_list()
 *            locate_sections()
 *
 * Returns:   status code
 *            (0 = success)
 *
 * Notes: List "data_memory_free_blocks" is needed by
 *        bfd_pic322_finish() to allocate the stack
 *        and heap, so don't exit this function early.
 *
 *        EDS allocation is tricky. Although these sections
 *        can be allocated anywhere, we need to preserve
 *        low memory for the stack. In the first pass,
 *        we exclude memory below the stack limit altogether.
 *        In the second pass, we scan free blocks in reverse
 *        only, which helps when a block crosses the
 *        stack limit boundary. Eventually we'll take
 *        whatever memory we need to, and leave the rest
 *        for the stack and heap.
 *
 *        We also support allocation of stack and heap
 *        that are defined with section attributes.
 *
 *        See comments below for additional info
 *        about stack allocation.
 */
static int
allocate_data_memory() {
  struct memory_region_struct *region = NULL;
  struct pic32_section *s;
  unsigned int mask = attr_mask_data | attr_mask_persist
		      | attr_mask_stack | attr_mask_heap | attr_mask_ramfunc;
  int result = 0;

  if (pic32_debug)
    printf("\nBuilding allocation list for region \"data\"\n"
           "  attribute mask = %x\n", mask);

  build_alloc_section_list(mask);

  if (pic32_is_l1cache_machine(global_PROCESSOR))
  {
    /* Try to use kseg0_data_mem, but fall back to kseg1_data_mem. */
    if (lang_memory_region_exist("kseg0_data_mem"))
      region = region_lookup ("kseg0_data_mem");
    else if (lang_memory_region_exist("kseg1_data_mem"))
      region = region_lookup ("kseg1_data_mem");
    else
      region = region_lookup ("kseg0_data_mem");
  }
  else
  {
    struct memory_region_struct *region1 = NULL, *region0 = NULL;
    /* Use the largest kseg0/1_data_mem region */
    if (lang_memory_region_exist("kseg1_data_mem"))
      region1 = region_lookup ("kseg1_data_mem");
    if (lang_memory_region_exist("kseg0_data_mem"))
      region0 = region_lookup ("kseg0_data_mem");
    
    if (region0 && region1)
    {
      if (pic32_debug)
        printf ("region0->length = %lx, region1->length = %lx\n",
                region0->length, region1->length);
      if ((region0->length) > (region1->length))
        region = region0;
      else
        region = region1;
    }
    else
    {
      if (region1)
        region = region1;
      else
        region = region0;
    }
  }
  if (region == NULL)
    einfo (_(" Link Error: kseg0_data_mem or kseg1_data_mem region must be defined for this device"));

  build_free_block_list(region, mask);

  if (pic32_debug) {
    pic32_print_section_list(alloc_section_list, "allocation");
  }
    
  /* lghica co-resident */
#if 1
    /*
     ** an initially empty list of blocks that can be shared in data memory
     */
    pic32_init_memory_list (&shared_data_memory_blocks);
#endif

  reset_locate_options();
  result |= locate_sections(attr_mask_ramfunc, 0, region);    /* most restrictive  */
  
  if (!bfd_pic32_is_defined_global_symbol("_ramfunc_begin"))
  {
    /* If there are no ram fumctions, add the _ramfunc_begin symbol with value 0 */
    _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd, "_ramfunc_begin",
    BSF_GLOBAL, bfd_abs_section_ptr,
    0, "_ramfunc_begin", 1, 0, 0);
  }
  
  if (ramfunc_begin != 0) {
    set_locate_options(EXCLUDE_HIGH_ADDR, ramfunc_begin);
  }
  result |= locate_sections(attr_mask_address, 0, region);
    
  coherent_section_count = 0;
  result |= locate_coherent_sections(attr_mask_data, region);  // allocate coherent data sections
    
  coherent_section_count = 0;
  result |= locate_coherent_sections(attr_mask_bss, region);	 // allocate coherent  sections
    
  coherent_section_count = 0;
  result |= locate_coherent_sections(attr_mask_persist, region);	 // allocate coherent persist sections
    
    
  result |= locate_sections(attr_mask_near, 0, region);       /* less restrictive  */
  result |= locate_sections ( attr_mask_all_attr,
			     attr_mask_stack | attr_mask_heap, region);

