zeha/xc32/pic32c-source/binutils/bfd/pic32m-allocate.c
#if 0
  /* user-defined heap */
  if (ramfunc_begin != 0) {
    set_locate_options(EXCLUDE_HIGH_ADDR, ramfunc_begin);
  }
  result |= locate_sections(attr_mask_heap, 0, region);

  /* user-defined stack */
  if (ramfunc_begin != 0) {
    set_locate_options(EXCLUDE_HIGH_ADDR, ramfunc_begin);
  }
  result |= locate_sections(attr_mask_stack, 0, region);
#else
  /* Don't support user-defined stack sections yet */
  for (s = alloc_section_list; s != NULL; s = s->next) {
      /* lghica co-resident */
#if 1
      if(s && (s->sec != NULL) && (s->sec->linked))
          continue;
#endif
    if (s->sec && (PIC32_IS_STACK_ATTR(s->sec) || PIC32_IS_HEAP_ATTR(s->sec))) {
      lang_output_section_statement_type *os;
      s->sec->lma = 0;
      s->sec->vma = 0;
      os = lang_output_section_statement_lookup (".stack", 0, TRUE);
      /* lang_add_section() will call init_os() if needed */
      lang_add_section (&os->children, s->sec, NULL, os);
      finish_section_info(s, os);
      pic32_remove_from_section_list(alloc_section_list,s);
      os->bfd_section->flags = s->sec->flags;
    }
  }

#endif
  result = result| allocate_bss(region);

  /* if any sections are left in the allocation list, report an error */
  for (s = alloc_section_list; s != NULL; s = s->next) {
    if ((s->attributes != 0) && (s->sec->linked == 0) /* lghica co-resident*/)
    {
      report_allocation_error(s);
      result = 1;
      break;
    }
  }

  /* save the free blocks list */
  data_memory_free_blocks = free_blocks;
  free_blocks = 0;

  return result;
} /* allocate_data_memory() */

static bfd_vma
group_section_size(struct pic32_section *g)
{
  struct pic32_section *s,*next;
  bfd_vma result = 0;

  for (s = g; s != NULL; s = next) {
    next = s->next;
    if (s->sec == 0)
      continue;
    if (s->sec && (PIC32_IS_RAMFUNC_ATTR(s->sec)))
      result += s->sec->size;
  }
  return result;
}

#define OUTSIDE_REGION(addr, len, region)          \
  (((addr + len) <= region->origin)                \
   || (addr >= (region->origin + region->length)))

#define ACROSS_REGION(addr, len, region)                            \
  (((addr < region->origin) && ((addr + len) > region->origin)) ||  \
   ((addr < (region->origin + region->length)) &&                   \
    ((addr + len) > (region->origin + region->length))))


/*
 * locate_group_section()
 *
 * Helper function to locate a grouped section
 * using the free_blocks list.
 *
 * Called by: locate_sections()
 *
 * Returns:   status code
 *            (0 = success)
 */

 static int
 locate_group_section(struct pic32_section *s,
                        struct memory_region_struct *region) {

  struct pic32_memory *b;
  bfd_vma len = group_section_size(s);
  bfd_vma addr = s->sec->lma;
  int result = 0;

  /* DEBUG */
  if (pic32_debug)
    printf("  group section \"%s\", total size = %lx\n",
           s->sec->name, len);
  /* 
    XC32-1581 - remove the upper 32b of an address that is knwon at build time:

      when the linker reads this address from the object file, a sign extension
      is performed => the upper 32b of the bfd_vma might be filled with 0xFFFFFFFF
  */
  if (PIC32_IS_ABSOLUTE_ATTR (s->sec))
    {
      addr &= 0x00000000FFFFFFFF;
    }

  /* look for tricky user error */
  if (PIC32_IS_ABSOLUTE_ATTR(s->sec) && ACROSS_REGION(addr, len, region))
        einfo(_(" Link Warning: absolute section \'%s\' crosses"
                " the boundary of region %s.\n"),
              s->sec->name, region->name_list.name);

  if (len == 0)
    update_group_section_info(0,s,region); /* trivial case */
  else if (PIC32_IS_ABSOLUTE_ATTR(s->sec) &&
           OUTSIDE_REGION(addr, len, region)) {
    update_group_section_info(addr, s, region);  /* falls outside region */
  }
  else {                          /* locate using free_blocks list */
    b = select_free_block(s, len);
    if (b) {
      addr = b->addr + b->offset;
      /* Translate the address from kseg0 to kseg1 */
      if (PIC32_IS_COHERENT_ATTR(s->sec))
        addr |= 0x20000000u;
      update_group_section_info(addr,s,region);
      create_remainder_blocks(free_blocks,b,len);
      remove_free_block(b);
    } else {
      if (locate_options != NO_LOCATE_OPTION) {
        if (pic32_debug)
          printf("    \"%s\" location declined\n", s->sec->name);
        return 0;
      }
      result |= 1;
    }
  }

  if (pic32_debug)
    printf("    removing group from allocation list\n");
  pic32_remove_group_from_section_list(alloc_section_list);

  return result;
} /* locate_group_section() */

/*
 * get_section_duplicate(asection *)
 *
 * Helper function to locate a section with a given name
 *      - it is called only for specific pic32 sections
 *      - In an application linked in one step this function should never get called
 *      - added for coresident feature, for multiple steps linking
 *
 * Called by: locate_single_section()
 *
 * Returns:  the section with the specified name, or NULL
 */
static asection* get_section_duplicate(asection * const sec_orig)
{
    asection *sec = NULL;
    
    /* find an output section with the same name */
    sec = bfd_get_section_by_name(link_info.output_bfd, sec_orig->name);
    
    if ((sec!= NULL) && (sec_orig != sec))
    {
        if (PIC32_IS_ABSOLUTE_ATTR(sec))
            return sec_orig;
        else
            return sec;
    }
    return NULL;
}

/*
 * locate_single_section()
 *
 * Helper function to locate a single section
 * using the free_blocks list.
 *
 * Called by: locate_sections()
 *
 * Returns:   status code
 *            (0 = success)
 */

 static int
 locate_single_section(struct pic32_section *s,
                       struct memory_region_struct *region) {

  struct pic32_memory *b;
  bfd_vma len = s->sec->rawsize? s->sec->rawsize : s->sec->size;
  bfd_vma addr = s->sec->lma;
  int result = 0;
  
  // XC32-1581
  if (PIC32_IS_ABSOLUTE_ATTR (s->sec))
    {
      addr &= 0x00000000FFFFFFFF;
    }

     if (pic32_debug && s->sec)
     {
         printf ("  %s with len %ld & addr %lx\n", s->sec->name, len, addr);
     }
     
     /* lghica co-resident*/
     asection* dup_sec;

     ///\ lookup in the input sections if there is another one with the same name
     if (s->sec && ( ( (strcmp(s->sec->name, ".text.version") == 0)
                        || (strcmp(s->sec->name, ".tlb_init_values") == 0)
                        || (strcmp(s->sec->name, ".simple_tlb_refill_excpt") == 0)
                        || (strcmp(s->sec->name,".cache_err_excpt")== 0)
                        || (strcmp(s->sec->name,".app_excpt")== 0)
                        || (strcmp(s->sec->name,".bev_excpt")== 0)
                        || (strstr(s->sec->name, "vector_offset") != NULL)
                      )
                    && (dup_sec = get_section_duplicate(s->sec))))
     {
         ///\ if the other section is allocated, just link to it
         s->sec->flags |= SEC_EXCLUDE;

         update_section_info(0, s, region);
         pic32_remove_from_section_list(alloc_section_list,s);
         return 0;
     }
     else if (s->sec && (strcmp(s->sec->name, ".text.version") == 0))
     {
         s->sec->flags |= SEC_EXCLUDE;
         pic32_remove_from_section_list(alloc_section_list,s);
         return 0;
     }
     
