zeha/xc32/pic32c-source/binutils/bfd/pic32m-allocate.c
  /* look for tricky user error */
  if (PIC32_IS_ABSOLUTE_ATTR(s->sec) && ACROSS_REGION(addr, len, region))
        einfo(_(" Link Warning: absolute section \'%s\' crosses"
                " the boundary of region %s.\n"),
              s->sec->name, region->name_list.name);
  
  if (len == 0)
    update_section_info(0,s,region);       /* trivial case */
  else if (PIC32_IS_ABSOLUTE_ATTR(s->sec) &&
           OUTSIDE_REGION(addr, len, region)) {
    update_section_info(addr, s, region);  /* falls outside region */
  }
  else{                          /* locate using free_blocks list */
    b = select_free_block(s, len);
    if (b) {
      addr = b->addr + b->offset;
      if (PIC32_IS_COHERENT_ATTR(s->sec))
        addr |= 0x20000000;
#if 1
        /* lghica co-resident */
      if (PIC32_IS_SHARED_ATTR(s->sec) && PIC32_IS_ABSOLUTE_ATTR(s->sec)
               && (s->sec->linked == 1))
      {
          struct pic32_memory * mem_reg;
          
          mem_reg = pic32_add_shared_to_memory_list(shared_data_memory_blocks,
                                            b->addr+b->offset, len, s->sec);
          
          if (pic32_debug)
              printf("LG --- SECTION in shared_data_memory %s (0x%lx - 0x%lx)\n",
                     s->sec->name, mem_reg->addr, mem_reg->size);
      }
#endif
      update_section_info(addr,s,region);
      create_remainder_blocks(free_blocks,b,len);
      remove_free_block(b);
    } else {
      if (locate_options != NO_LOCATE_OPTION) {
        if (pic32_debug)
          printf("    \"%s\" location declined\n", s->sec->name);
        return 0;
      }
      result |= 1;
    }
  }

  if (pic32_debug)
    printf("    removing from allocation list\n");
  pic32_remove_from_section_list(alloc_section_list,s);

  return result;
} /* locate_single_section() */


/*
 * locate_sections()
 *
 * This function attempts to locate all sections
 * in the section list that match a specified
 * attribute mask. The block argument specifies
 * attributes that disqualify a section.
 *
 * Called by: allocate_program_memory()
 *            allocate_data_memory()
 *            allocate_eedata_memory()
 *            allocate_auxflash_memory()
 *
 * Calls:     select_free_block()
 *            update_section_info()
 *            create_remainder_blocks()
 *            remove_free_block()
 *            remove_alloc_section()
 *
 * Returns:   status code
 *            (0 = success)
 */
static int
locate_sections(unsigned int mask, unsigned int block,
                struct memory_region_struct *region) {
  struct pic32_section *s,*next;
  int result = 0;
  static int ramfunc_section_count = 0;

  if (pic32_debug) {
    printf("\nLocating sections with mask %x, but not %x\n", mask, block);
    printf("  locate_options = %x, exclude_addr = %lx\n",
           locate_options, exclude_addr);
  }

  for (s = alloc_section_list; s != NULL; s = next) {

      next = s->next;
      /* lghica co-resident */
#if 1
      if (s->sec && (PIC32_IS_DATA_ATTR(s->sec) || PIC32_IS_BSS_ATTR(s->sec))
            && !PIC32_IS_ABSOLUTE_ATTR(s->sec) && (s->sec->linked == 1))
      {
          update_section_info(s->sec->lma, s, region);
      }
#endif
      
    if (s->sec && (s->attributes & mask) &&
        ((s->attributes & block) == 0)) {
      bfd_vma len = s->sec->rawsize? s->sec->rawsize: s->sec->size;

      if (pic32_debug) {
        char *attr = pic32_section_attr_string(s->sec);

        printf("  b \"%s\", len = %lx, %s\n",
               s->sec->name, (unsigned long)len, attr ? attr : "");
        if (attr) free(attr);
      }

      if (PIC32_IS_RAMFUNC_ATTR(s->sec)) {
          if (ramfunc_section_count == 0) {
              set_locate_options(FAVOR_HIGH_ADDR,0);
              s->sec->alignment_power = 11;
              ramfunc_section_count++;
              result |= locate_group_section(s, region);
              if (s->sec->vma == 0)
                {
                  report_allocation_error(s);
                }
              ramfunc_begin = s->sec->vma;
              if (!bfd_pic32_is_defined_global_symbol("_ramfunc_begin")) {
                _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd, "_ramfunc_begin",
                                    BSF_GLOBAL, bfd_abs_section_ptr,
                                    ramfunc_begin, "_ramfunc_begin", 1, 0, 0);
              } else {
                einfo(_("Link Warning: Cannot define '_ramfunc_begin' due to existing definition; check linker script\n"));
              }
              if (pic32_debug)
                printf("  _ramfunc_begin = %x\n", (unsigned int)ramfunc_begin);
              if (!bfd_pic32_is_defined_global_symbol("_bmxdkpba_address")) {
                _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd, "_bmxdkpba_address",
                                    BSF_GLOBAL, bfd_abs_section_ptr,
                                    ramfunc_begin - region->origin, "_bmxdkpba_address", 1, 0, 0);
              } else {
                einfo(_("Link Warning: Cannot define '_bmxdkpba_address' due to existing definition; check linker script\n"));
              }
              if (pic32_debug)
                printf("  _bmxdkpba_address = %x\n", (unsigned int)(ramfunc_begin - region->origin));
            }
        }
      else {
          result |= locate_single_section(s, region);
        }
      }
  }
  return result;
} /* locate_sections() */


/*
 * next_aligned_address()
 */
static bfd_vma
next_aligned_address( bfd_vma start, unsigned int align_power) {

  bfd_vma mask = ~((~0) << align_power);
  return (bfd_vma) ((start + 1 + mask) & (~mask));
}


/*
 * prev_aligned_address()
 */
static bfd_vma
prev_aligned_address( bfd_vma start, unsigned int align_power) {

  bfd_vma mask = ~((~0) << align_power);
  if (start < mask)
    return (bfd_vma) 0;
  else
    return (bfd_vma) ((start - 1 - mask) & (~mask));
}


/*
 * select_free_block()
 *
 * This function attempts to select a suitable
 * free block for a specified section. For each
 * free block, the section is positioned two ways:
 *  (1) as close to the starting address as possible,
 *  (2) as close to the ending address as possible.
 *
 * The position that leaves the largest unused
 * remainder space is selected. If a suitable free
 * block is found, the block offset is written into
 * the free block structure and the structure is returned.
 *
 * The selection algorithm can be fine-tuned by previous
 * calls to set_locate_options().
 *
 * Called by: locate_sections()
 *            locate_group_sections()
 *
 * Calls:     pic32_static_assign_memory()
 *            next_aligned_address()
 *            prev_aligned_address()
 *
 * Returns:   suitable free block, or 0
 */

