zeha/xc32/pic32c-source/binutils/bfd/pic32m-allocate.c
#if 0
static void
confirm_dma_range_defined() {
  struct bfd_link_hash_entry *h;
  static bfd_boolean base_err_reported = FALSE;
  static bfd_boolean end_err_reported = FALSE;

  if ((!dma_base_defined) || (!dma_end_defined)) {

    h = bfd_pic32_is_defined_global_symbol(str3);
    if (h) {
      dma_base = h->u.def.value;
      dma_base_defined = TRUE;
    }
    else {
      if (!base_err_reported) {
        einfo(_(str1), str3);
        base_err_reported = TRUE;
      }
    }

    h = bfd_pic32_is_defined_global_symbol(str4);
    if (h) {
      dma_end = h->u.def.value;
      dma_end_defined = TRUE;
    }
    else {
      if (!end_err_reported) {
        einfo(_(str1), str4);
        end_err_reported = TRUE;
      }
    }
  }
}
#endif


static struct pic32_memory *
select_free_block(struct pic32_section *s, unsigned int len) {

  unsigned int align_power = s->sec->alignment_power;

  const char *err_str1 = "Link Error: Could not allocate section";

  struct pic32_memory *b = 0;
  bfd_vma option1, limit1;
  bfd_vma option2, limit2;
  bfd_boolean option1_valid, option2_valid;
/* lghica co-resident */
    unsigned int    opb = bfd_octets_per_byte (link_info.output_bfd);
    bfd_vma         old_option1, new_option1;
    bfd_vma         old_option2, new_option2;
    
    
  /*
   * If the section is absolute, call the static function
   */
  if (PIC32_IS_ABSOLUTE_ATTR(s->sec))
  {
          bfd_vma addr = s->sec->lma & 0x00000000FFFFFFFF;
          b = pic32_static_assign_memory(free_blocks, len, addr);
    if (!b) {
        if ((s->sec->flags & SEC_NEVER_LOAD) ||
            (command_line.check_section_addresses == FALSE))
          /* OK, don't report as error */;
        else
        {
            einfo(_("%X %s \'%s\' at 0x%v SIZE %d\n"),
                err_str1, s->sec->name, s->sec->lma, s->sec->size);
        }
        return (struct pic32_memory *) NULL;
    } else
      return b;
  }
#if 1
    /* lghica co-resident shared but not linked yet!!! -  to check*/
   else if (PIC32_IS_SHARED_ATTR(s->sec) && !PIC32_IS_ABSOLUTE_ATTR(s->sec))
    {
        if (pic32_debug && (s->sec->linked == 0))
            printf("LG - is shared & abs %s\n", s->sec->name);
        b = pic32_assign_shared_memory(shared_data_memory_blocks, len, s);
        if (b)
        {
            s->sec->lma = b->addr;
            return b;
        }
    }
#endif

#if 0
  /*
   * If DMA attribute is set, make sure
   * we have a definition for __DMA_BASE and __DMA_END
   * Usually this appears in the linker script.
   */
  if (PIC32_IS_DMA_ATTR(s->sec)) {
    confirm_dma_range_defined();
  }
#endif

  /*
   * Loop through the free blocks list
   */
  for (b = free_blocks; b != NULL; b = b->next) {

    if ((b->addr == 0) && (b->size == 0))
      continue;

    if (pic32_debug)
      printf("    consider block at %lx, len = %lx\n", b->addr, b->size);

    /*
     * Qualify the block first, so we don't waste
     *  time scanning for alignment.
     */
    if (b->size < len)
      continue;


    /* qualify NEAR with leftmost position in free block */
    if (PIC32_IS_NEAR_ATTR(s->sec) && !VALID_NEAR(b->addr, len))
      continue;

    /* qualify LOW_ADDR with leftmost position in free block */
    if (IS_LOCATE_OPTION(EXCLUDE_HIGH_ADDR) &&
        !VALID_LOW_ADDR(b->addr, len))
      continue;

    /* qualify HIGH_ADDR with rightmost position in free block */
    if (IS_LOCATE_OPTION(EXCLUDE_LOW_ADDR) &&
        !VALID_HIGH_ADDR((b->addr + b->size - len), len))
      continue;

    /* fall through if block passes pre-qual tests */

    /* Compute option1: scan from the start of the block */
    option1 = b->addr - 1 ;
    limit1  = b->addr + (b->size - len);
    option1_valid = TRUE; /* set default */
    if (pic32_debug)
      printf("    option1 [advancing from %lx]\n", option1 + 2);
    while (1) {

      if (IS_LOCATE_OPTION(FAVOR_HIGH_ADDR)) {
        option1_valid = FALSE;
        break;
      }

      /* find the next aligned address */
      if (PIC32_IS_REVERSE_ATTR(s->sec)) {
        option1 = next_aligned_address(option1 + len, align_power);
        option1 -= len;
      }
      else
        option1 = next_aligned_address(option1, align_power);

      if (option1 > limit1) {
        option1_valid = FALSE;
        break;
      }


      if (pic32_debug)
        printf("    option1 aligned at %lx\n", option1);

      /* aligned address is valid, check other attributes */


        if (PIC32_IS_NEAR_ATTR(s->sec)  && !VALID_NEAR(option1, len)) {
        option1_valid = FALSE;  /* scanning forward won't help */
        break;
      }
        
      /* lghica co-resident */
#if 1
        /* this check is necessary for Co-resident applications */
        /* to make sure persistent data is not over written at any time */
        
        if (PIC32_IS_PERSIST_ATTR(s->sec) || PIC32_IS_SHARED_ATTR(s->sec))
        {
            old_option1 = option1;
            new_option1 = option1;
            struct pic32_section *ls;
            for (ls = alloc_section_list; ls != NULL; ls = ls->next)
            {
                if (ls->sec && (ls->sec->linked == 1))
                {
                    if (((ls->sec->lma <= old_option1)
                         && (old_option1 < (ls->sec->lma + (ls->sec->rawsize / opb)))))
                    {
                        new_option1 = ls->sec->lma + (ls->sec->rawsize / opb);
                        break;
                    }
                }
            }
            if (new_option1 != old_option1)
                continue;
            else
                option1= new_option1;
        }
#endif
        
      if (IS_LOCATE_OPTION(EXCLUDE_LOW_ADDR) &&
          !VALID_HIGH_ADDR(option1, len)) {
        option1 = exclude_addr - 1;  /* skip ahead */
        if (pic32_debug)
          printf("    approaching EXCLUDE boundary from %lx\n", option1);
        continue;
      }

      /* if we get here, the option is valid */
      break;
    } /* while (!done) */

    /* Compute option2: scan from the end of the block       */
    /*                  unless the section is BOOT or SECURE */
    option2 = limit1 + 1;
    limit2  = b->addr;
      option2_valid = TRUE; /* set default */
      if (pic32_debug)
        printf("    option2 [descending from %lx]\n", option2 - 2);
      while (1) {

        if (IS_LOCATE_OPTION(FAVOR_LOW_ADDR)) {
          option2_valid = FALSE;
          break;
        }

