zeha/xc32/pic32c-source/binutils/bfd/pic32m-allocate.c
  if (pic32_debug)
    printf("\nBuilding free block list for region \"%s\"\n"
           "  origin = %lx, length = %lx, current = %lx\n",
           region->name_list.name, region->origin, region->length, region->current );

  /* find any gaps left by sequential allocator */
        dot = region->origin;
    
  limit = dot + region->length;
  for (s = pic32_section_list; s != NULL; s = s->next) {

      if (pic32_debug && s->sec)
        printf("    Checking (section \"%s\", lma = %lx, vma = %lx, len = %lx, attr = %x)\n",
               s->sec->name, s->sec->lma, s->sec->vma,
               s->sec->rawsize? s->sec->rawsize : s->sec->size,
               s->attributes);

    if (s->sec && (s->use_vma==0) &&
        (s->sec->lma >= region->origin) &&
           (s->sec->lma <= (region->origin + region->length)))
        ma = s->sec->lma;
    else if (s->sec && (s->use_vma) &&
        (s->sec->vma >= region->origin) &&
           (s->sec->vma <= (region->origin + region->length)))
        ma = s->sec->vma;
    else
        ma = 0;

    if ((s->sec) && ((s->sec->rawsize | s->sec->size) > 0) && ma) {
      if (pic32_debug)
        printf("    (section \"%s\", addr = %lx, len = %lx, attr = %x)\n",
               s->sec->name, ma,
               s->sec->rawsize? s->sec->rawsize : s->sec->size,
               s->attributes);
      if (ma == dot)                   /* no gap, just advance dot */
        dot += s->sec->rawsize? s->sec->rawsize : s->sec->size;
      else if (ma >= limit)   /* section belongs to another region */
        continue;
      else if (ma > dot) {               /* a gap preceeds section */
        len = ma - dot;                          /* compute length */
        if (pic32_debug)
          printf("  block %d, addr = %lx, len = %lx\n",
                 ++cnt, dot, len);
        pic32_add_to_memory_list(free_blocks, dot, len);  /* add free block */
        dot += len + (s->sec->rawsize? s->sec->rawsize : s->sec->size);           /* advance dot    */
      }
    }
  }

  /* add a block for any free space remaining in this region */
  /* .. use dot, because region->current may have been set for CodeGuard */
  len = region->length - (dot - region->origin);
  if (len > 0) {
    if (pic32_debug)
      printf("  block %d, addr = %lx, len = %lx\n",
             ++cnt, dot, len);
    pic32_add_to_memory_list(free_blocks, dot, len);
  }
} /* build_free_block_list() */


/*
 * remove_free_block()
 *
 * Remove an item from the free memory blocks list.
 *
 */
static void
remove_free_block(struct pic32_memory *b) {
  pic32_remove_from_memory_list(free_blocks, b);
}


/*
 * allocate_default_stack()
 *
 * If a stack section was not explicitly defined,
 * and the stack init symbols were not defined,
 * then this function is called to allocate the
 * largest stack possible from data_memory_free_blocks.
 *
 * Called by: bfd_pic32_finish()
 *
 * Calls:     pic32_add_to_memory_list()
 *            pic32_remove_from_memory_list()
 *
 * Returns:   sets global vars stack_base, stack_limit
 *
 * Notes: The free blocks list is sorted in order
 *        of increasing size
 *
 *        The calling function will confirm that
 *        the resulting stack satisfies the minimum
 *        size requirements.
 *
 *
 */

static void
allocate_default_stack() {
  struct pic32_memory *big_block = 0;
  struct pic32_memory *b, *next;
  bfd_vma under,over;
#define KSEG1_DATA_MEM_LIMIT 0xFFFFFFFFul;
  bfd_vma max_addr = KSEG1_DATA_MEM_LIMIT;

  /* if a free block straddles the upper limit, divide it */
  for (b = data_memory_free_blocks; b != NULL; b = next) {
    next = b->next;
    if ((b->addr < max_addr) && ((b->addr + b->size) > max_addr)) {

      if (pic32_debug)
        printf("  free block at %lx crosses upper stack limit (%lx)\n",
               b->addr, max_addr);

      under = max_addr - b->addr;
      over  = (b->addr + b->size) - max_addr;

      pic32_add_to_memory_list(data_memory_free_blocks, b->addr, under);
      pic32_add_to_memory_list(data_memory_free_blocks, max_addr, over);
      pic32_remove_from_memory_list(data_memory_free_blocks, b);
      break;
    }
  }

  /* find the largest block that qualifies */
  for (b = data_memory_free_blocks; b != NULL; b = next) {
    if (b->addr < max_addr)
      big_block = b;
    next = b->next;
  }

  if ((int)(pic32_heap_size) >
      (int)big_block->size) {
    heap_base = (big_block->addr + 1);
    heap_limit = (heap_base + (big_block->size) - 0x80u);
    einfo("%P%X Error: Not enough memory for heap"
          " (%d bytes needed, %d bytes available)\n",
            (int)(pic32_heap_size),
            (int)(heap_limit - heap_base));
  } else {
    heap_base = (big_block->addr + 1);
    heap_limit = (heap_base + pic32_heap_size);
  }
  while (heap_base % 8 != 0)
    heap_base++;
  while (heap_limit % 8 != 0)
    heap_limit++;

  stack_base  = (heap_limit + 1 + pic32_stackguard_size);
  stack_limit = (heap_base + big_block->size
                 - pic32_stackguard_size + 1);
  /* Stack must be aligned by 8 */
  while (stack_base % 8 != 0)
    stack_base++;
  while (stack_limit % 8 != 0)
    stack_limit--;

  if (pic32_debug) {
    printf("  selecting block at %lx\n", big_block->addr);
    printf("  heap base = %x, heap limit = %x\n", heap_base, heap_limit);
    printf("  stack base = %x, stack limit = %x\n", stack_base, stack_limit);
  }

  /* remove the block that we just used */
  pic32_remove_from_memory_list(data_memory_free_blocks, big_block);
}




static int
compare_memory_region_origin (const void *a, const void *b)
{
  const asection *sec1 = *(const asection **) a;
  const asection *sec2 = *(const asection **) b;

 
  /* If there's no section for some reason, compare equal.  */
  if (!sec1 || !sec2)
    return 0;
  
  if (sec1->vma < sec2->vma)
    return -1;
  else if (sec1->vma > sec2->vma)
    return 1;
  
  return 0;
}

static void
check_overlapping_memory_regions (asection **asec_list, unsigned int asec_count)
{
  unsigned int i ;
  asection* a = NULL ;
  asection* b = NULL ;
  const char *asec_name = NULL ;
  const char *bsec_name = NULL ;

  /* MERGE-NOTES: FIXME? asec_count == 0 would mean an underflow here. */
  for (i=0; i<(asec_count-1); i++)
  {
    a = asec_list[i];
    b = asec_list[i+1];
    
    if ( (a->vma + a->lma) > b->vma )
    {
        asec_name = a->name + strlen(memory_region_prefix) + 1;
        bsec_name = b->name + strlen(memory_region_prefix) + 1;

        einfo(_(" Link Error: user defined memory region \'%s\' crosses"
                " the boundary of region '%s'.\n"),
                asec_name, bsec_name);
    }
  }
}


static int 
validate_memory_region_list(void)
{
  /* Build a sorted list of memory regions, then use that to validate */
  struct pic32_section *r, *rnext;
  unsigned int list_size = 10;
  unsigned int sec_count = 0;

  asection **sec_list = (asection **)
    xmalloc (list_size * sizeof (asection *));

