zeha/xc32/pic32c-source/binutils/bfd/pic32m-allocate.c
  for (r = memory_region_list; r != NULL; r = rnext) 
  {
    rnext = r->next;
    asection *asec = r->sec;
    if (asec) 
    {
      if (sec_count == list_size) 
      {
        list_size *= 2;
        sec_list = (asection **) 
        xrealloc (sec_list, list_size * sizeof (asection *));
      }

      sec_list[sec_count++] = asec;
    }
  }

  qsort (sec_list, sec_count, sizeof (asection *), &compare_memory_region_origin);
  check_overlapping_memory_regions(sec_list, sec_count);
  free (sec_list);

  return 0;
}



/*
 * allocate_user_memory()
 *
 * This function attempts to allocate sections
 * in user-defined memory regions.
 *
 * Called by: allocate_memory()
 *
 * Calls:     build_section_list()
 *            build_free_block_list()
 *            locate_sections() 
 *
 * Returns:   status code
 *            (0 = success)
 */
static int
allocate_user_memory() {
  struct memory_region_struct temp_region;
  struct pic32_section *r, *rnext, *s, *snext, *ss, *ssnext, *ssprev;
  const char *region_name;
  int result = 0;

  /* Validate that the memory region list don't overlapping*/
  validate_memory_region_list();

  /* loop through any user-defined regions */
  for (r = memory_region_list; r != NULL; r = rnext) {
  
    rnext = r->next;
    if (r->sec == 0) continue;
    
    region_name = r->sec->name + strlen(memory_region_prefix);
    if (pic32_debug)
      printf("\nBuilding allocation list for user-defined region \"%s\""
             " origin = %lx, length = %lx\n",
             region_name, r->sec->vma, r->sec->lma);

    /* the assembler will not accept a memory region
       definition with length 0... if we see one here,
       it indicates that a section has referenced a
       region that was never defined */
    if (r->sec->lma == 0)
      einfo(_("%s: Link Error: Memory region \'%s\' has been referenced"
              " but not defined\n"),
              r->sec->owner->filename, region_name);

    /* loop through the list of memory-type sections..
       note that only two fields of this list are
       used (file, sec) and they are both (char *) */
    for (s = user_memory_sections; s != NULL; s = snext) {

      snext = s->next;
      if (!s->file || !s->sec) continue;
      
#if 0
      printf("s->file =%s, s->sec = %s \n", (char *) s->file, (char *) s->sec);
#endif
      if (strcmp((char *)s->file, region_name) == 0) {
        /* if this section has been assigned to the current region,
           add it to the allocation list */
        ssprev = unassigned_sections;
        for (ss = ssprev; ss != NULL; ss = ssnext) {
          ssnext = ss->next;
          if (ss->sec && strcmp((char *) s->sec, ss->sec->name) == 0) {
            if (pic32_debug)
              printf("  input section \"%s\", len = %lx, flags = %x, attr = %x\n",
                     ss->sec->name, ss->sec->size,
                     ss->sec->flags, ss->attributes);

            insert_alloc_section(alloc_section_list, ss);
            ssprev->next = ssnext; /* unlink it from unassigned_sections */
          } else
            ssprev = ss;
        }
      }
    }
    
    if (pic32_section_list_length(alloc_section_list) == 0) {
      if (pic32_debug)
        printf("\n  (none)\n");
      continue;
    }
      
//    temp_region.name = (char *) region_name;
    temp_region.next = &temp_region;
    temp_region.origin = r->sec->vma;
    temp_region.length = r->sec->lma;

    /* don't expect to need these.. */
    temp_region.current = r->sec->vma;
//    temp_region.old_length = 0;
    temp_region.flags = 0;
    temp_region.not_flags = 0;
    temp_region.had_full_message = FALSE;

    if (free_blocks)
      pic32_free_memory_list(&free_blocks);
    pic32_init_memory_list(&free_blocks);
  
    /* start with entire region as a free block */
    pic32_add_to_memory_list(free_blocks, temp_region.origin,
                             temp_region.length);

    if (pic32_debug) {
      pic32_print_section_list(alloc_section_list, "allocation");
    }
  
    result |= locate_sections(attr_mask_address, 0, &temp_region);   /* most restrictive  */
    result |= locate_sections(attr_mask_all_attr, 0, &temp_region);  /* least restrictive */
  }

  return result;
} /* allocate_user_memory() */


// Coherent sections processing functions

void swap_sections_within_group(struct pic32_section *a, struct pic32_section *b) {
// swap element a with element b in the singly-linked list of pic32_sections.
// it is complex and error prone to mess with the pointers in the list so we 
// just swap the contents except for the next pointers ... here are some struct assignments
    struct pic32_section temp = *a;
    temp.next = b->next;
    b->next = a->next;
    *a = *b;
    *b = temp;
} 

void sort_coherent_group_section(unsigned int mask) {

// the sections that form a group need to be sorted by alignment level, large to small.
// We expect the actual number of such sections to be small so we are unambitious.  Insertion sort is good enough.
    struct pic32_section *s1, *nexts1,*s2, *nexts2;

    for (s1 = alloc_section_list; s1 != NULL; s1 = nexts1) {
        nexts1 = s1->next;
        if (s1->sec && ((s1->attributes & mask) == mask) &&  (PIC32_IS_COHERENT_ATTR(s1->sec)) ) {
	    // make sure that all elements in the list that come after s1 have smaller alignment
            for (s2 = nexts1; s2 != NULL; s2 = nexts2) {
		nexts2 = s2->next;
                if (s2->sec && ((s2->attributes & mask) == mask) &&  (PIC32_IS_COHERENT_ATTR(s2->sec)) 
		    && (s2->sec->alignment_power > s1->sec->alignment_power ))  {
			swap_sections_within_group(s1,s2);
		} 
	    }
	}
    }
}



static void
update_coherent_group_section_info(bfd_vma alloc_addr,
                                   struct pic32_section *g,
                                   unsigned int mask,
                                   struct memory_region_struct *region ATTRIBUTE_UNUSED) {
    
    struct pic32_section *s, *next;
    asection *sec;
    char *name;
    bfd_vma addr = alloc_addr;
    lang_output_section_statement_type *os;
    
    /* create a unique name for the output section, if necessary */
    sec = bfd_get_section_by_name(link_info.output_bfd, g->sec->name);
    if (sec) {
        name = ( g->sec->size > 0) ?
        unique_section_name(g->sec->name) :
        unique_zero_length_section_name(g->sec->name);
    }
    else {
        name = (char *) g->sec->name;
	if (PIC32_IS_COHERENT_ATTR (g->sec)
	    && ((g->attributes & mask)
		== (attr_mask_coherent | attr_mask_data)))
	  {
            strcpy(name, ".COHERENTDATA$");
          }
	else if (PIC32_IS_COHERENT_ATTR (g->sec)
		 && ((g->attributes & mask)
		     == (attr_mask_coherent | attr_mask_bss)))
	  {
            strcpy(name, ".COHERENTBSS$");
          }
	else if (PIC32_IS_COHERENT_ATTR (g->sec)
		 && ((g->attributes & mask)
		     == (attr_mask_coherent | attr_mask_persist)))
	  {
            strcpy(name, ".COHERENTPERSIST$");
          }
        else
        {}
    }
    /* create an output section (statement) */
    os = lang_output_section_statement_lookup (name, 0, TRUE);
    
    /* loop through the input sections in this group */
    for (s = g; s != NULL; s = next) {
        next = s->next;
        if (s->sec && (PIC32_IS_COHERENT_ATTR(s->sec)) && ((s->attributes & mask) == mask) ) {
            update_section_addr(s->sec, addr);
            addr += (s->sec->size);
            
            /* lang_add_section() will call init_os() if needed */
            lang_add_section (&os->children, s->sec, NULL, os);
            
