zeha/xc32/pic32c-source/binutils/bfd/pic32m-allocate.c
        }
    }
    finish_section_info(g, os);
} /* update_coherent_group_section_info() */



static bfd_vma
group_coherent_section_size(struct pic32_section *g, unsigned int mask)
{
    struct pic32_section *s,*next;
    bfd_vma result = 0;
    unsigned int alignment_bytes_needed;
    
    for (s = g; s != NULL; s = next) {
        next = s->next;
        if (s->sec == 0)
            continue;
        if (s->sec && (PIC32_IS_COHERENT_ATTR(s->sec)) && ((s->attributes & mask) == mask)){
           // first correct for alignment
            if(s->sec->alignment_power > 0) {
		alignment_bytes_needed = 1 << (s->sec->alignment_power);

		if (result % alignment_bytes_needed) result += alignment_bytes_needed  - (result % alignment_bytes_needed);
	    }
            result += s->sec->size;
	}
    }
    return result;
}

static int
locate_coherent_group_section(struct pic32_section *s,
                              struct memory_region_struct *region, unsigned int mask) {
    
    struct pic32_memory *b;
    bfd_vma len = 0;
    bfd_vma addr = s->sec->lma;
    int result = 0;
    unsigned int pad_req;
    
    sort_coherent_group_section(mask);
    len = group_coherent_section_size(s, mask);
    

    // Set len to 16 byte padding.
    pad_req = len%16 ;
    if (pad_req)
        len = len + (16-pad_req);
  
  // XC32-1581
  if (PIC32_IS_ABSOLUTE_ATTR (s->sec))
    {
      addr &= 0x00000000FFFFFFFF;
    }

    /* look for tricky user error */
    if (PIC32_IS_ABSOLUTE_ATTR(s->sec) && ACROSS_REGION(addr, len, region))
        einfo(_(" Link Warning: absolute section \'%s\' crosses"
                " the boundary of region %s.\n"),
              s->sec->name, region->name_list.name);
    
    if (len == 0)
        update_coherent_group_section_info(0,s,mask,region); /* trivial case */
    else if (PIC32_IS_ABSOLUTE_ATTR(s->sec) &&
             OUTSIDE_REGION(addr, len, region)) {
        update_coherent_group_section_info(addr,s,mask,region);  /* falls outside region */
    }
    else {                          /* locate using free_blocks list */
        b = select_free_block(s, len);
        if (b) {
            addr = b->addr + b->offset;
            /* Translate the address from kseg0 to kseg1 */
            if (PIC32_IS_COHERENT_ATTR(s->sec))
                addr |= 0x20000000u;
            update_coherent_group_section_info(addr,s,mask,region);
            create_remainder_blocks(free_blocks,b,len);
            remove_free_block(b);
        } else {
            if (locate_options != NO_LOCATE_OPTION) {
                return 0;
            }
            result |= 1;
        }
    }
    
    pic32_remove_coherent_group_from_section_list(alloc_section_list, mask);
    
    return result;
} /* locate_group_section() */



static int
locate_coherent_sections (unsigned int mask,
                          struct memory_region_struct *region) {
    struct pic32_section *s,*next;
    int result = 0;
    
    mask = attr_mask_coherent | mask ;
    
    for (s = alloc_section_list; s != NULL; s = next) {
        next = s->next;
        if (s->sec && (s->attributes & mask) == mask) {
            if (PIC32_IS_COHERENT_ATTR(s->sec)) {

                if (coherent_section_count == 0) {
                    // Set the alignment to at least cache line boundary (16 byte)
                    if(s->sec->alignment_power < 4) s->sec->alignment_power = 4;
                    coherent_section_count++;
                    result |= locate_coherent_group_section(s, region, mask);
                    ///\ fix XC32-707 report error only for non-empty sections
                    if ((s->sec->vma == 0) && (s->sec->size != 0))
                    {
                        report_allocation_error(s);
                    }
                }
            }
        }
    }
    return result;
} /* locate_coherent_sections */
